tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18325_tdd.h
#define SSP2MSK_MSK6                  522
#define SSP2MSK6                      523
#define SSP2MSK_MSK7                  524
#define SSP2MSK7                      525
#define SSP2STAT                      526
#define SSP2STAT_BF                   527
#define SSP2STAT_UA                   528
#define SSP2STAT_R_nW                 529
#define SSP2STAT_S                    530
#define SSP2STAT_P                    531
#define SSP2STAT_D_nA                 532
#define SSP2STAT_CKE                  533
#define SSP2STAT_SMP                  534
#define SSP2CON1                      535
#define SSP2CON1_SSPM                 536
#define SSP2CON1_SSPM0                537
#define SSP2CON1_SSPM1                538
#define SSP2CON1_SSPM2                539
#define SSP2CON1_SSPM3                540
#define SSP2CON1_CKP                  541
#define SSP2CON1_SSPEN                542
#define SSP2CON1_SSPOV                543
#define SSP2CON1_WCOL                 544
#define SSP2CON2                      545
#define SSP2CON2_SEN                  546
#define SSP2CON2_RSEN                 547
#define SSP2CON2_PEN                  548
#define SSP2CON2_RCEN                 549
#define SSP2CON2_ACKEN                550
#define SSP2CON2_ACKDT                551
#define SSP2CON2_ACKSTAT              552
#define SSP2CON2_GCEN                 553
#define SSP2CON3                      554
#define SSP2CON3_DHEN                 555
#define SSP2CON3_AHEN                 556
#define SSP2CON3_SBCDE                557
#define SSP2CON3_SDAHT                558
#define SSP2CON3_BOEN                 559
#define SSP2CON3_SCIE                 560
#define SSP2CON3_PCIE                 561
#define SSP2CON3_ACKTIM               562
#define ODCONA                        563
#define ODCA0                         564
#define ODCA1                         565
#define ODCA2                         566
#define ODCA4                         567
#define ODCA5                         568
#define ODCONC                        569
#define ODCC0                         570
#define ODCC1                         571
#define ODCC2                         572
#define ODCC3                         573
#define ODCC4                         574
#define ODCC5                         575
#define CCPR1L                        576
#define CCPR1H                        577
#define CCP1CON                       578
#define CCP1MODE                      579
#define CCP1MODE0                     580
#define CCP1MODE1                     581
#define CCP1MODE2                     582
#define CCP1MODE3                     583
#define CCP1FMT                       584
#define CCP1OUT                       585
#define CCP1EN                        586
#define CCP1CAP                       587
#define CCP1CTS0                      588
#define CCP1CAP_CCP1CTS               589
#define CCP1CTS1                      590
#define CCP1CTS2                      591
#define CCP1CTS3                      592
#define CCPR2L                        593
#define CCPR2H                        594
#define CCP2CON                       595
#define CCP2MODE                      596
#define CCP2MODE0                     597
#define CCP2MODE1                     598
#define CCP2MODE2                     599
#define CCP2MODE3                     600
#define CCP2FMT                       601
#define CCP2OUT                       602
#define CCP2EN                        603
#define CCP2CAP                       604
#define CCP2CAP_CCP1CTS               605
#define CCP2CTS0                      606
#define CCP2CTS1                      607
#define CCP2CTS2                      608
#define CCP2CTS3                      609
#define CCPTMRS                       610
#define C1TSEL0                       611
#define C1TSEL                        612
#define C1TSEL1                       613
#define C2TSEL0                       614
#define C2TSEL                        615
#define C2TSEL1                       616
#define C3TSEL0                       617
#define C3TSEL                        618
#define C3TSEL1                       619
#define C4TSEL                        620
#define C4TSEL0                       621
#define C4TSEL1                       622
#define SLRCONA                       623
#define SLRA0                         624
#define SLRA1                         625
#define SLRA2                         626
#define SLRA4                         627
#define SLRA5                         628
#define SLRCONC                       629
#define SLRC0                         630
#define SLRC1                         631
#define SLRC2                         632
#define SLRC3                         633
#define SLRC4                         634
#define SLRC5                         635
#define CCPR3L                        636
#define CCPR3H                        637
#define CCP3CON                       638
#define CCP3MODE0                     639
#define CCP3MODE                      640
#define CCP3MODE1                     641
#define CCP3MODE2                     642
#define CCP3MODE3                     643
#define CCP3FMT                       644
#define CCP3OUT                       645
#define CCP3EN                        646
#define CCP3CAP                       647
#define CCP3CTS                       648
#define CCAP0                         649
#define CCAP1                         650
#define CCAP2                         651
#define CCAP3                         652
#define CCPR4L                        653
#define CCPR4H                        654
#define CCP4CON                       655
#define CCP4MODE                      656
#define CCP4MODE0                     657
#define CCP4MODE1                     658
#define CCP4MODE2                     659
#define CCP4MODE3                     660
#define CCP4FMT                       661
#define CCP4OUT                       662
#define CCP4EN                        663
#define CCP4CAP                       664
#define CCP4CTS                       665
#define CCP4CTS0                      666
#define CCP4CTS1                      667
#define CCP4CTS2                      668
#define CCP4CTS3                      669
#define INLVLA                        670
#define INLVLA0                       671
#define INLVLA1                       672
#define INLVLA2                       673
#define INLVLA3                       674
#define INLVLA4                       675
#define INLVLA5                       676
#define INLVLC                        677
#define INLVLC0                       678
#define INLVLC1                       679
#define INLVLC2                       680
#define INLVLC3                       681
#define INLVLC4                       682
#define INLVLC5                       683
#define IOCAP                         684
#define IOCAP0                        685
#define IOCAP1                        686
#define IOCAP2                        687
#define IOCAP3                        688
#define IOCAP4                        689
#define IOCAP5                        690
#define IOCAN                         691
#define IOCAN0                        692
#define IOCAN1                        693
#define IOCAN2                        694
#define IOCAN3                        695
#define IOCAN4                        696
#define IOCAN5                        697
#define IOCAF                         698
#define IOCAF0                        699
#define IOCAF1                        700
#define IOCAF2                        701
#define IOCAF3                        702
#define IOCAF4                        703
#define IOCAF5                        704
#define IOCCP                         705
#define IOCCP0                        706
#define IOCCP1                        707
#define IOCCP2                        708
#define IOCCP3                        709
#define IOCCP4                        710
#define IOCCP5                        711
#define IOCCN                         712
#define IOCCN0                        713
#define IOCCN1                        714
#define IOCCN2                        715
#define IOCCN3                        716
#define IOCCN4                        717
#define IOCCN5                        718
#define IOCCF                         719
#define IOCCF0                        720
#define IOCCF1                        721
#define IOCCF2                        722
#define IOCCF3                        723
#define IOCCF4                        724
#define IOCCF5                        725
#define CLKRCON                       726
#define CLKRDIV                       727
#define CLKRDIV0                      728
#define CLKRDIV1                      729
#define CLKRDIV2                      730
#define CLKRDC                        731
#define CLKRDC0                       732
#define CLKRDC1                       733
#define CLKREN                        734
#define MDCON                         735
#define MDBIT                         736
#define MDOUT                         737
#define MDOPOL                        738
#define MDEN                          739
#define MDSRC                         740
#define MDMS0                         741
#define MDMS                          742
#define MDMS1                         743
#define MDMS2                         744
#define MDMS3                         745
#define MDCARH                        746
#define MDCH                          747
#define MDCH0                         748
#define MDCH1                         749
#define MDCH2                         750
#define MDCH3                         751
#define MDCHSYNC                      752
#define MDCHPOL                       753
#define MDCARL                        754
#define MDCL0                         755
#define MDCL                          756
#define MDCL1                         757
#define MDCL2                         758
#define MDCL3                         759
#define MDCLSYNC                      760
#define MDCLPOL                       761
#define CCDNA                         762
#define CCDNA0                        763
#define CCDNA1                        764
#define CCDNA2                        765
#define CCDNA4                        766
#define CCDNA5                        767
#define CCDNC                         768
#define CCDNC0                        769
#define CCDNC1                        770
#define CCDNC2                        771
#define CCDNC3                        772
#define CCDNC4                        773
#define CCDNC5                        774
#define TMR3L                         775
#define TMR3H                         776
#define T3CON                         777
#define TMR3ON                        778
#define T3SYNC                        779
#define T3SOSC                        780
#define T3CKPS                        781
#define T3CKPS0                       782
#define T3CKPS1                       783
#define TMR3CS0                       784
#define TMR3CS                        785
#define TMR3CS1                       786
#define T3GCON                        787
#define T3GSS0                        788
#define T3GSS                         789
#define T3GSS1                        790
#define T3GVAL                        791
#define T3GGO_nDONE                   792
#define T3GSPM                        793
#define T3GTM                         794
#define T3GPOL                        795
#define TMR3GE                        796
#define TMR4                          797
#define PR4                           798
#define T4CON                         799
#define T4CKPS0                       800
#define T4CKPS                        801
#define T4CKPS1                       802
#define TMR4ON                        803
#define T4OUTPS                       804
#define T4OUTPS0                      805
#define T4OUTPS1                      806
#define T4OUTPS2                      807
#define T4OUTPS3                      808
#define TMR5L                         809
#define TMR5H                         810
#define T5CON                         811
#define TMR5ON                        812
#define T5SYNC                        813
#define T5SOSC                        814
#define T5CKPS                        815
#define T5CKPS0                       816
#define T5CKPS1                       817
#define TMR5CS0                       818
#define TMR5CS                        819
#define TMR5CS1                       820
#define T5GCON                        821
#define T5GSS                         822
#define T5GSS0                        823
#define T5GSS1                        824
#define T5GVAL                        825
#define T5GGO_nDONE                   826
#define T5GSPM                        827
#define T5GTM                         828
#define T5GPOL                        829
#define TMR5GE                        830
#define TMR6                          831
#define PR6                           832
#define T6CON                         833
#define T6CKPS0                       834
#define T6CKPS                        835
#define T6CKPS1                       836
#define TMR6ON                        837
#define T6OUTPS0                      838
#define T6OUTPS                       839
#define T6OUTPS1                      840
#define T6OUTPS2                      841
#define T6OUTPS3                      842
#define CCDCON                        843
#define CCDS                          844
#define CCDS0                         845
#define CCDS1                         846
#define CCDEN                         847
#define CCDPA                         848
#define CCDPA0                        849
#define CCDPA1                        850
#define CCDPA2                        851
#define CCDPA4                        852
#define CCDPA5                        853
#define CCDPC                         854
#define CCDPC0                        855
#define CCDPC1                        856
#define CCDPC2                        857
#define CCDPC3                        858
#define CCDPC4                        859
#define CCDPC5                        860
#define NCO1ACCL                      861
#define NCO1ACCL_NCO1ACC              862
#define NCO1ACCH                      863
#define NCO1ACCH_NCO1ACC              864
#define NCO1ACCU                      865
#define NCO1ACCU_NCO1ACC              866
#define NCO1INCL                      867
#define NCO1INCL_NCO1INC              868
#define NCO1INCH                      869
#define NCO1INCH_NCO1INC              870
#define NCO1INCU                      871
#define NCO1INCU_NCO1INC              872
#define NCO1CON                       873
#define N1PFM                         874
#define N1POL                         875
#define N1OUT                         876
#define N1EN                          877
#define NCO1CLK                       878
#define N1CKS                         879
#define N1PWS                         880
#define PWM5DCL                       881
#define PWM5DCL0                      882
#define PWM5DCL1                      883
#define PWM5DCH                       884
#define PWM5DCH0                      885
#define PWM5DCH1                      886
#define PWM5DCH2                      887
#define PWM5DCH3                      888
#define PWM5DCH4                      889
#define PWM5DCH5                      890
#define PWM5DCH6                      891
#define PWM5DCH7                      892
#define PWM5CON                       893
#define PWM5POL                       894
#define PWM5OUT                       895
#define PWM5EN                        896
#define PWM6DCL                       897
#define PWM6DCL0                      898
#define PWM6DCL1                      899
#define PWM6DCH                       900
#define PWM6DCH0                      901
#define PWM6DCH1                      902
#define PWM6DCH2                      903
#define PWM6DCH3                      904
#define PWM6DCH4                      905
#define PWM6DCH5                      906
#define PWM6DCH6                      907
#define PWM6DCH7                      908
#define PWM6CON                       909
#define PWM6POL                       910
#define PWM6OUT                       911
#define PWM6EN                        912
#define PWMTMRS                       913
#define P5TSEL                        914
#define P5TSEL0                       915
#define P5TSEL1                       916
#define P6TSEL0                       917
#define P6TSEL                        918
#define P6TSEL1                       919
#define CWG1CLKCON                    920
#define CWG1CLKCON_CS                 921
#define CWG1CS                        922
#define CWG1DAT                       923
#define CWG1DAT_DAT                   924
#define CWG1DAT0                      925
#define CWG1DAT1                      926
#define CWG1DAT2                      927
#define CWG1DAT3                      928
#define CWG1DBR_DBR                   929
#define CWG1DBR0                      930
#define CWG1DBR_DBR0                  931
#define CWG1DBR                       932
#define CWG1DBR1                      933
#define CWG1DBR_DBR1                  934
#define CWG1DBR2                      935
#define CWG1DBR_DBR2                  936
#define CWG1DBR3                      937
#define CWG1DBR_DBR3                  938
#define CWG1DBR_DBR4                  939
#define CWG1DBR4                      940
#define CWG1DBR5                      941
#define CWG1DBR_DBR5                  942
#define CWG1DBF                       943
#define CWG1DBF0                      944
#define CWG1DBF_DBF                   945
#define CWG1DBF_DBF0                  946
#define CWG1DBF1                      947
#define CWG1DBF_DBF1                  948
#define CWG1DBF_DBF2                  949
#define CWG1DBF2                      950
#define CWG1DBF3                      951
#define CWG1DBF_DBF3                  952
#define CWG1DBF_DBF4                  953
#define CWG1DBF4                      954
#define CWG1DBF_DBF5                  955
#define CWG1DBF5                      956
#define CWG1CON0                      957
#define CWG1MODE0                     958
#define CWG1CON0_MODE                 959
#define CWG1CON0_MODE0                960
#define CWG1MODE                      961
#define CWG1MODE1                     962
#define CWG1CON0_MODE1                963
#define CWG1MODE2                     964
#define CWG1CON0_MODE2                965
#define CWG1CON0_LD                   966
#define CWG1LD                        967
#define CWG1EN                        968
#define G1EN                          969
#define CWG1CON0_EN                   970
#define CWG1CON1                      971
#define CWG1POLA                      972
#define CWG1CON1_POLA                 973
#define CWG1CON1_POLB                 974
#define CWG1POLB                      975
#define CWG1POLC                      976
#define CWG1CON1_POLC                 977
#define CWG1CON1_POLD                 978
#define CWG1POLD                      979
#define CWG1CON1_IN                   980
#define CWG1IN                        981
#define CWG1AS0                       982
#define CWG1LSAC                      983
#define CWG1AS0_LSAC0                 984
#define CWG1AS0_LSAC                  985
#define CWG1LSAC0                     986
#define CWG1AS0_LSAC1                 987
#define CWG1LSAC1                     988
#define CWG1AS0_LSBD0                 989
#define CWG1LSBD0                     990
#define CWG1LSBD                      991
#define CWG1AS0_LSBD                  992
#define CWG1LSBD1                     993
#define CWG1AS0_LSBD1                 994
#define CWG1AS0_REN                   995
#define CWG1REN                       996
#define CWG1AS0_SHUTDOWN              997
#define CWG1SHUTDOWN                  998
#define CWG1AS1                       999
#define CWG1AS1_AS0E                  1000
#define CWG1AS1_AS1E                  1001
#define CWG1AS1_AS2E                  1002
#define CWG1AS1_AS3E                  1003
#define CWG1AS1_AS4E                  1004
#define CWG1STR                       1005
#define CWG1STRA                      1006
#define CWG1STR_STRA                  1007
#define CWG1STRB                      1008
#define CWG1STR_STRB                  1009
#define CWG1STRC                      1010
#define CWG1STR_STRC                  1011
#define CWG1STR_STRD                  1012
#define CWG1STRD                      1013
#define CWG1OVRA                      1014
#define CWG1STR_OVRA                  1015
#define CWG1OVRB                      1016
#define CWG1STR_OVRB                  1017
#define CWG1OVRC                      1018
#define CWG1STR_OVRC                  1019
#define CWG1OVRD                      1020
#define CWG1STR_OVRD                  1021
#define CWG2CLKCON                    1022
#define CWG2CS                        1023
#define CWG2CLKCON_CS                 1024
#define CWG2DAT                       1025
#define CWG2DAT0                      1026
#define CWG2DAT_DAT                   1027
#define CWG2DAT1                      1028
#define CWG2DAT2                      1029
#define CWG2DAT3                      1030
#define CWG2DBR_DBR                   1031
#define CWG2DBR_DBR0                  1032
#define CWG2DBR                       1033
#define CWG2DBR0                      1034
#define CWG2DBR_DBR1                  1035
#define CWG2DBR1                      1036
#define CWG2DBR_DBR2                  1037
#define CWG2DBR2                      1038
#define CWG2DBR_DBR3                  1039
#define CWG2DBR3                      1040
#define CWG2DBR_DBR4                  1041
#define CWG2DBR4                      1042
#define CWG2DBR_DBR5                  1043
#define CWG2DBR5                      1044
#define CWG2DBF                       1045
#define CWG2DBF_DBF0                  1046
#define CWG2DBF_DBF                   1047
#define CWG2DBF0                      1048
#define CWG2DBF_DBF1                  1049
#define CWG2DBF1                      1050
#define CWG2DBF_DBF2                  1051
#define CWG2DBF2                      1052
#define CWG2DBF_DBF3                  1053
#define CWG2DBF3                      1054
#define CWG2DBF_DBF4                  1055
#define CWG2DBF4                      1056
#define CWG2DBF5                      1057
#define CWG2DBF_DBF5                  1058
#define CWG2CON0                      1059
#define CWG2MODE                      1060
#define CWG2MODE0                     1061
#define CWG2CON0_MODE                 1062
#define CWG2CON0_MODE0                1063
#define CWG2MODE1                     1064
#define CWG2CON0_MODE1                1065
#define CWG2MODE2                     1066
#define CWG2CON0_MODE2                1067
#define CWG2LD                        1068
#define CWG2CON0_LD                   1069
#define CWG2CON0_EN                   1070
#define CWG2EN                        1071
#define G2EN                          1072
#define CWG2CON1                      1073
#define CWG2POLA                      1074
#define CWG2CON1_POLA                 1075
#define CWG2POLB                      1076
#define CWG2CON1_POLB                 1077
#define CWG2POLC                      1078
#define CWG2CON1_POLC                 1079
#define CWG2CON1_POLD                 1080
#define CWG2POLD                      1081
#define CWG2IN                        1082
#define CWG2CON1_IN                   1083
#define CWG2AS0                       1084
#define CWG2LSAC                      1085
#define CWG2AS0_LSAC                  1086
#define CWG2LSAC0                     1087
#define CWG2AS0_LSAC0                 1088
#define CWG2LSAC1                     1089
#define CWG2AS0_LSAC1                 1090
