tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18325_tdd.h
#define CWG2AS0_LSBD0                 1091
#define CWG2LSBD                      1092
#define CWG2AS0_LSBD                  1093
#define CWG2LSBD0                     1094
#define CWG2AS0_LSBD1                 1095
#define CWG2LSBD1                     1096
#define CWG2AS0_REN                   1097
#define CWG2REN                       1098
#define CWG2AS0_SHUTDOWN              1099
#define CWG2SHUTDOWN                  1100
#define CWG2AS1                       1101
#define CWG2AS1_AS0E                  1102
#define CWG2AS1_AS1E                  1103
#define CWG2AS1_AS2E                  1104
#define CWG2AS1_AS3E                  1105
#define CWG2AS1_AS4E                  1106
#define CWG2STR                       1107
#define CWG2STR_STRA                  1108
#define CWG2STRA                      1109
#define CWG2STR_STRB                  1110
#define CWG2STRB                      1111
#define CWG2STR_STRC                  1112
#define CWG2STRC                      1113
#define CWG2STR_STRD                  1114
#define CWG2STRD                      1115
#define CWG2STR_OVRA                  1116
#define CWG2OVRA                      1117
#define CWG2OVRB                      1118
#define CWG2STR_OVRB                  1119
#define CWG2STR_OVRC                  1120
#define CWG2OVRC                      1121
#define CWG2OVRD                      1122
#define CWG2STR_OVRD                  1123
#define NVMADR0                       1124
#define NVMADRL                       1125
#define NVMADR1                       1126
#define NVMADR2                       1127
#define NVMADR3                       1128
#define NVMADR4                       1129
#define NVMADR5                       1130
#define NVMADR6                       1131
#define NVMADR7                       1132
#define NVMADR8                       1133
#define NVMADRH                       1134
#define NVMADR9                       1135
#define NVMADR10                      1136
#define NVMADR11                      1137
#define NVMADR12                      1138
#define NVMADR13                      1139
#define NVMADR14                      1140
#define NVMDAT0                       1141
#define NVMDATL                       1142
#define NVMDAT1                       1143
#define NVMDAT2                       1144
#define NVMDAT3                       1145
#define NVMDAT4                       1146
#define NVMDAT5                       1147
#define NVMDAT6                       1148
#define NVMDAT7                       1149
#define NVMDAT8                       1150
#define NVMDATH                       1151
#define NVMDAT9                       1152
#define NVMDAT10                      1153
#define NVMDAT11                      1154
#define NVMDAT12                      1155
#define NVMDAT13                      1156
#define NVMCON1                       1157
#define RD                            1158
#define WR                            1159
#define WREN                          1160
#define WRERR                         1161
#define FREE                          1162
#define LWLO                          1163
#define NVMREGS                       1164
#define NVMCON2                       1165
#define NMVCON2                       1166
#define PCON0                         1167
#define nBOR                          1168
#define nPOR                          1169
#define nRI                           1170
#define nRMCLR                        1171
#define nRWDT                         1172
#define STKUNF                        1173
#define STKOVF                        1174
#define PMD0                          1175
#define IOCMD                         1176
#define CLKRMD                        1177
#define NVMMD                         1178
#define FVRMD                         1179
#define SYSCMD                        1180
#define PMD1                          1181
#define TMR0MD                        1182
#define TMR1MD                        1183
#define TMR2MD                        1184
#define TMR3MD                        1185
#define TMR4MD                        1186
#define TMR5MD                        1187
#define TMR6MD                        1188
#define NCOMD                         1189
#define PMD2                          1190
#define CMP1MD                        1191
#define CMP2MD                        1192
#define ADCMD                         1193
#define DACMD                         1194
#define PMD3                          1195
#define CCP1MD                        1196
#define CCP2MD                        1197
#define CCP3MD                        1198
#define CCP4MD                        1199
#define PWM5MD                        1200
#define PWM6MD                        1201
#define CWG1MD                        1202
#define CWG2MD                        1203
#define PMD4                          1204
#define MSSP1MD                       1205
#define MSSP2MD                       1206
#define UART1MD                       1207
#define PMD5                          1208
#define DSMMD                         1209
#define CLC1MD                        1210
#define CLC2MD                        1211
#define CLC3MD                        1212
#define CLC4MD                        1213
#define CPUDOZE                       1214
#define DOZE0                         1215
#define DOZE                          1216
#define DOZE1                         1217
#define DOZE2                         1218
#define DOE                           1219
#define ROI                           1220
#define DOZEN                         1221
#define IDLEN                         1222
#define OSCCON1                       1223
#define NDIV0                         1224
#define NDIV                          1225
#define NDIV1                         1226
#define NDIV2                         1227
#define NDIV3                         1228
#define NOSC0                         1229
#define NOSC                          1230
#define NOSC1                         1231
#define NOSC2                         1232
#define OSCCON2                       1233
#define CDIV0                         1234
#define CDIV                          1235
#define CDIV1                         1236
#define CDIV2                         1237
#define CDIV3                         1238
#define COSC                          1239
#define COSC0                         1240
#define COSC1                         1241
#define COSC2                         1242
#define OSCCON3                       1243
#define NOSCR                         1244
#define ORDY                          1245
#define SOSCBE                        1246
#define SOSCPWR                       1247
#define CSWHOLD                       1248
#define OSCSTAT1                      1249
#define PLLR                          1250
#define ADOR                          1251
#define SOR                           1252
#define LFOR                          1253
#define HFOR                          1254
#define EXTOR                         1255
#define OSCEN                         1256
#define ADOEN                         1257
#define SOSCEN                        1258
#define LFOEN                         1259
#define HFOEN                         1260
#define EXTOEN                        1261
#define OSCTUNE                       1262
#define HFTUN0                        1263
#define HFTUN                         1264
#define HFTUN1                        1265
#define HFTUN2                        1266
#define HFTUN3                        1267
#define HFTUN4                        1268
#define HFTUN5                        1269
#define OSCFRQ                        1270
#define HFFRQ                         1271
#define HFFRQ0                        1272
#define HFFRQ1                        1273
#define HFFRQ2                        1274
#define HFFRQ3                        1275
#define PPSLOCK                       1276
#define PPSLOCKED                     1277
#define INTPPS0                       1278
#define INTPPS                        1279
#define INTPPS1                       1280
#define INTPPS2                       1281
#define INTPPS3                       1282
#define INTPPS4                       1283
#define T0CKIPPS0                     1284
#define T0CKIPPS                      1285
#define T0CKIPPS1                     1286
#define T0CKIPPS2                     1287
#define T0CKIPPS3                     1288
#define T0CKIPPS4                     1289
#define T1CKIPPS0                     1290
#define T1CKIPPS                      1291
#define T1CKIPPS1                     1292
#define T1CKIPPS2                     1293
#define T1CKIPPS3                     1294
#define T1CKIPPS4                     1295
#define T1GPPS0                       1296
#define T1GPPS                        1297
#define T1GPPS1                       1298
#define T1GPPS2                       1299
#define T1GPPS3                       1300
#define T1GPPS4                       1301
#define CCP1PPS0                      1302
#define CCP1PPS                       1303
#define CCP1PPS1                      1304
#define CCP1PPS2                      1305
#define CCP1PPS3                      1306
#define CCP1PPS4                      1307
#define CCP2PPS0                      1308
#define CCP2PPS                       1309
#define CCP2PPS1                      1310
#define CCP2PPS2                      1311
#define CCP2PPS3                      1312
#define CCP2PPS4                      1313
#define CCP3PPS0                      1314
#define CCP3PPS                       1315
#define CCP3PPS1                      1316
#define CCP3PPS2                      1317
#define CCP3PPS3                      1318
#define CCP3PPS4                      1319
#define CCP4PPS0                      1320
#define CCP4PPS                       1321
#define CCP4PPS1                      1322
#define CCP4PPS2                      1323
#define CCP4PPS3                      1324
#define CCP4PPS4                      1325
#define CWG1PPS0                      1326
#define CWG1PPS                       1327
#define CWG1PPS1                      1328
#define CWG1PPS2                      1329
#define CWG1PPS3                      1330
#define CWG1PPS4                      1331
#define CWG2PPS0                      1332
#define CWG2PPS                       1333
#define CWG2PPS1                      1334
#define CWG2PPS2                      1335
#define CWG2PPS3                      1336
#define CWG2PPS4                      1337
#define MDCIN1PPS                     1338
#define MDCIN1PPS0                    1339
#define MDCIN1PPS1                    1340
#define MDCIN1PPS2                    1341
#define MDCIN1PPS3                    1342
#define MDCIN1PPS4                    1343
#define MDCIN2PPS0                    1344
#define MDCIN2PPS                     1345
#define MDCIN2PPS1                    1346
#define MDCIN2PPS2                    1347
#define MDCIN2PPS3                    1348
#define MDCIN2PPS4                    1349
#define MDMINPPS                      1350
#define MDMINPPS0                     1351
#define MDMINPPS1                     1352
#define MDMINPPS2                     1353
#define MDMINPPS3                     1354
#define MDMINPPS4                     1355
#define SSP2CLKPPS                    1356
#define SSP2CLKPPS0                   1357
#define SSP2CLKPPS1                   1358
#define SSP2CLKPPS2                   1359
#define SSP2CLKPPS3                   1360
#define SSP2CLKPPS4                   1361
#define SSP2DATPPS                    1362
#define SSP2DATPPS0                   1363
#define SSP2DATPPS1                   1364
#define SSP2DATPPS2                   1365
#define SSP2DATPPS3                   1366
#define SSP2DATPPS4                   1367
#define SSP2SSPPS                     1368
#define SSP2SSPPS0                    1369
#define SSP2SSPPS1                    1370
#define SSP2SSPPS2                    1371
#define SSP2SSPPS3                    1372
#define SSP2SSPPS4                    1373
#define SSP1CLKPPS0                   1374
#define SSP1CLKPPS                    1375
#define SSP1CLKPPS1                   1376
#define SSP1CLKPPS2                   1377
#define SSP1CLKPPS3                   1378
#define SSP1CLKPPS4                   1379
#define SSP1DATPPS0                   1380
#define SSP1DATPPS                    1381
#define SSP1DATPPS1                   1382
#define SSP1DATPPS2                   1383
#define SSP1DATPPS3                   1384
#define SSP1DATPPS4                   1385
#define SSP1SSPPS                     1386
#define SSP1SSPPS0                    1387
#define SSP1SSPPS1                    1388
#define SSP1SSPPS2                    1389
#define SSP1SSPPS3                    1390
#define SSP1SSPPS4                    1391
#define RXPPS                         1392
#define RXDTPPS0                      1393
#define RXDTPPS1                      1394
#define RXDTPPS2                      1395
#define RXDTPPS3                      1396
#define RXDTPPS4                      1397
#define TXCKPPS0                      1398
#define TXPPS                         1399
#define TXCKPPS1                      1400
#define TXCKPPS2                      1401
#define TXCKPPS3                      1402
#define TXCKPPS4                      1403
#define CLCIN0PPS                     1404
#define CLCIN0PPS0                    1405
#define CLCIN0PPS1                    1406
#define CLCIN0PPS2                    1407
#define CLCIN0PPS3                    1408
#define CLCIN0PPS4                    1409
#define CLCIN1PPS0                    1410
#define CLCIN1PPS                     1411
#define CLCIN1PPS1                    1412
#define CLCIN1PPS2                    1413
#define CLCIN1PPS3                    1414
#define CLCIN1PPS4                    1415
#define CLCIN2PPS                     1416
#define CLCIN2PPS0                    1417
#define CLCIN2PPS1                    1418
#define CLCIN2PPS2                    1419
#define CLCIN2PPS3                    1420
#define CLCIN2PPS4                    1421
#define CLCIN3PPS                     1422
#define CLCIN3PPS0                    1423
#define CLCIN3PPS1                    1424
#define CLCIN3PPS2                    1425
#define CLCIN3PPS3                    1426
#define CLCIN3PPS4                    1427
#define T3CKIPPS                      1428
#define T3GPPS                        1429
#define T5CKIPPS                      1430
#define T5GPPS                        1431
#define RA0PPS                        1432
#define RA0PPS0                       1433
#define RA0PPS1                       1434
#define RA0PPS2                       1435
#define RA0PPS3                       1436
#define RA0PPS4                       1437
#define RA1PPS                        1438
#define RA1PPS0                       1439
#define RA1PPS1                       1440
#define RA1PPS2                       1441
#define RA1PPS3                       1442
#define RA1PPS4                       1443
#define RA2PPS0                       1444
#define RA2PPS                        1445
#define RA2PPS1                       1446
#define RA2PPS2                       1447
#define RA2PPS3                       1448
#define RA2PPS4                       1449
#define RA4PPS                        1450
#define RA4PPS0                       1451
#define RA4PPS1                       1452
#define RA4PPS2                       1453
#define RA4PPS3                       1454
#define RA4PPS4                       1455
#define RA5PPS                        1456
#define RA5PPS0                       1457
#define RA5PPS1                       1458
#define RA5PPS2                       1459
#define RA5PPS3                       1460
#define RA5PPS4                       1461
#define RC0PPS                        1462
#define RC0PPS0                       1463
#define RC0PPS1                       1464
#define RC0PPS2                       1465
#define RC0PPS3                       1466
#define RC0PPS4                       1467
#define RC1PPS0                       1468
#define RC1PPS                        1469
#define RC1PPS1                       1470
#define RC1PPS2                       1471
#define RC1PPS3                       1472
#define RC1PPS4                       1473
#define RC2PPS                        1474
#define RC2PPS0                       1475
#define RC2PPS1                       1476
#define RC2PPS2                       1477
#define RC2PPS3                       1478
#define RC2PPS4                       1479
#define RC3PPS                        1480
#define RC3PPS0                       1481
#define RC3PPS1                       1482
#define RC3PPS2                       1483
#define RC3PPS3                       1484
#define RC3PPS4                       1485
#define RC4PPS0                       1486
#define RC4PPS                        1487
#define RC4PPS1                       1488
#define RC4PPS2                       1489
#define RC4PPS3                       1490
#define RC4PPS4                       1491
#define RC5PPS0                       1492
#define RC5PPS                        1493
#define RC5PPS1                       1494
#define RC5PPS2                       1495
#define RC5PPS3                       1496
#define RC5PPS4                       1497
#define CLCDATA                       1498
#define MLC1OUT                       1499
#define MLC2OUT                       1500
#define MLC3OUT                       1501
#define MLC4OUT                       1502
#define CLC1CON                       1503
#define CLC1CON_MODE0                 1504
#define LC1MODE                       1505
#define CLC1CON_MODE                  1506
#define LC1MODE0                      1507
#define CLC1CON_MODE1                 1508
#define LC1MODE1                      1509
#define LC1MODE2                      1510
#define CLC1CON_MODE2                 1511
#define LC1INTN                       1512
#define CLC1CON_INTN                  1513
#define CLC1CON_INTP                  1514
#define LC1INTP                       1515
#define LC1OUT                        1516
#define CLC1CON_OUT                   1517
#define CLC1CON_EN                    1518
#define LC1EN                         1519
#define CLC1POL                       1520
#define LC1G1POL                      1521
#define CLC1POL_G1POL                 1522
#define CLC1POL_G2POL                 1523
#define LC1G2POL                      1524
#define LC1G3POL                      1525
#define CLC1POL_G3POL                 1526
#define LC1G4POL                      1527
#define CLC1POL_G4POL                 1528
#define CLC1POL_POL                   1529
#define LC1POL                        1530
#define CLC1SEL0                      1531
#define CLC1SEL0_D1S0                 1532
#define LC1D1S0                       1533
#define CLC1SEL0_D1S                  1534
#define LC1D1S                        1535
#define CLC1SEL0_D1S1                 1536
#define LC1D1S1                       1537
#define CLC1SEL0_D1S2                 1538
#define LC1D1S2                       1539
#define LC1D1S3                       1540
#define CLC1SEL0_D1S3                 1541
#define CLC1SEL0_D1S4                 1542
#define LC1D1S4                       1543
#define CLC1SEL0_D1S5                 1544
#define LC1D1S5                       1545
#define CLC1SEL1                      1546
#define CLC1SEL1_D2S0                 1547
#define CLC1SEL1_D2S                  1548
#define LC1D2S                        1549
#define LC1D2S0                       1550
#define CLC1SEL1_D2S1                 1551
#define LC1D2S1                       1552
#define CLC1SEL1_D2S2                 1553
#define LC1D2S2                       1554
#define LC1D2S3                       1555
#define CLC1SEL1_D2S3                 1556
#define LC1D2S4                       1557
#define CLC1SEL1_D2S4                 1558
#define LC1D2S5                       1559
#define CLC1SEL1_D2S5                 1560
#define CLC1SEL2                      1561
#define LC1D3S0                       1562
#define CLC1SEL2_D3S                  1563
#define LC1D3S                        1564
#define CLC1SEL2_D3S0                 1565
#define LC1D3S1                       1566
#define CLC1SEL2_D3S1                 1567
#define LC1D3S2                       1568
#define CLC1SEL2_D3S2                 1569
#define LC1D3S3                       1570
#define CLC1SEL2_D3S3                 1571
#define LC1D3S4                       1572
#define CLC1SEL2_D3S4                 1573
#define LC1D3S5                       1574
#define CLC1SEL2_D3S5                 1575
#define CLC1SEL3                      1576
#define CLC1SEL3_D4S                  1577
#define LC1D4S                        1578
#define LC1D4S0                       1579
#define CLC1SEL3_D4S0                 1580
#define CLC1SEL3_D4S1                 1581
#define LC1D4S1                       1582
#define LC1D4S2                       1583
#define CLC1SEL3_D4S2                 1584
#define LC1D4S3                       1585
#define CLC1SEL3_D4S3                 1586
#define LC1D4S4                       1587
#define CLC1SEL3_D4S4                 1588
#define LC1D4S5                       1589
#define CLC1SEL3_D4S5                 1590
#define CLC1GLS0                      1591
#define CLC1GLS0_D1N                  1592
#define LC1G1D1N                      1593
#define CLC1GLS0_D1T                  1594
#define LC1G1D1T                      1595
#define LC1G1D2N                      1596
#define CLC1GLS0_D2N                  1597
#define LC1G1D2T                      1598
#define CLC1GLS0_D2T                  1599
#define CLC1GLS0_D3N                  1600
#define LC1G1D3N                      1601
#define CLC1GLS0_D3T                  1602
#define LC1G1D3T                      1603
#define CLC1GLS0_D4N                  1604
#define LC1G1D4N                      1605
#define CLC1GLS0_D4T                  1606
#define LC1G1D4T                      1607
#define CLC1GLS1                      1608
#define CLC1GLS1_D1N                  1609
#define LC1G2D1N                      1610
#define LC1G2D1T                      1611
#define CLC1GLS1_D1T                  1612
#define CLC1GLS1_D2N                  1613
#define LC1G2D2N                      1614
#define LC1G2D2T                      1615
#define CLC1GLS1_D2T                  1616
#define CLC1GLS1_D3N                  1617
#define LC1G2D3N                      1618
#define LC1G2D3T                      1619
#define CLC1GLS1_D3T                  1620
#define CLC1GLS1_D4N                  1621
#define LC1G2D4N                      1622
#define LC1G2D4T                      1623
#define CLC1GLS1_D4T                  1624
#define CLC1GLS2                      1625
#define CLC1GLS2_D1N                  1626
#define LC1G3D1N                      1627
#define LC1G3D1T                      1628
#define CLC1GLS2_D1T                  1629
#define LC1G3D2N                      1630
#define CLC1GLS2_D2N                  1631
#define LC1G3D2T                      1632
#define CLC1GLS2_D2T                  1633
#define CLC1GLS2_D3N                  1634
#define LC1G3D3N                      1635
#define LC1G3D3T                      1636
#define CLC1GLS2_D3T                  1637
#define LC1G3D4N                      1638
#define CLC1GLS2_D4N                  1639
#define LC1G3D4T                      1640
#define CLC1GLS2_D4T                  1641
#define CLC1GLS3                      1642
#define LC1G4D1N                      1643
#define CLC1GLS3_G4D1N                1644
#define LC1G4D1T                      1645
#define CLC1GLS3_G4D1T                1646
#define CLC1GLS3_G4D2N                1647
#define LC1G4D2N                      1648
