tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf18325_tdd.h
#define CLC1GLS3_G4D2T                1649
#define LC1G4D2T                      1650
#define LC1G4D3N                      1651
#define CLC1GLS3_G4D3N                1652
#define LC1G4D3T                      1653
#define CLC1GLS3_G4D3T                1654
#define CLC1GLS3_G4D4N                1655
#define LC1G4D4N                      1656
#define CLC1GLS3_G4D4T                1657
#define LC1G4D4T                      1658
#define CLC2CON                       1659
#define LC2MODE0                      1660
#define CLC2CON_MODE                  1661
#define LC2MODE                       1662
#define CLC2CON_MODE0                 1663
#define LC2MODE1                      1664
#define CLC2CON_MODE1                 1665
#define LC2MODE2                      1666
#define CLC2CON_MODE2                 1667
#define LC2INTN                       1668
#define CLC2CON_INTN                  1669
#define LC2INTP                       1670
#define CLC2CON_INTP                  1671
#define CLC2CON_OUT                   1672
#define LC2OUT                        1673
#define CLC2CON_EN                    1674
#define LC2EN                         1675
#define CLC2POL                       1676
#define LC2G1POL                      1677
#define CLC2POL_G1POL                 1678
#define LC2G2POL                      1679
#define CLC2POL_G2POL                 1680
#define LC2G3POL                      1681
#define CLC2POL_G3POL                 1682
#define LC2G4POL                      1683
#define CLC2POL_G4POL                 1684
#define CLC2POL_POL                   1685
#define LC2POL                        1686
#define CLC2SEL0                      1687
#define CLC2SEL0_D1S                  1688
#define LC2D1S0                       1689
#define CLC2SEL0_D1S0                 1690
#define LC2D1S                        1691
#define LC2D1S1                       1692
#define CLC2SEL0_D1S1                 1693
#define LC2D1S2                       1694
#define CLC2SEL0_D1S2                 1695
#define CLC2SEL0_D1S3                 1696
#define LC2D1S3                       1697
#define LC2D1S4                       1698
#define CLC2SEL0_D1S4                 1699
#define LC2D1S5                       1700
#define CLC2SEL0_D1S5                 1701
#define CLC2SEL1                      1702
#define LC2D2S0                       1703
#define CLC2SEL1_D2S0                 1704
#define LC2D2S                        1705
#define CLC2SEL1_D2S                  1706
#define LC2D2S1                       1707
#define CLC2SEL1_D2S1                 1708
#define LC2D2S2                       1709
#define CLC2SEL1_D2S2                 1710
#define LC2D2S3                       1711
#define CLC2SEL1_D2S3                 1712
#define LC2D2S4                       1713
#define CLC2SEL1_D2S4                 1714
#define LC2D2S5                       1715
#define CLC2SEL1_D2S5                 1716
#define CLC2SEL2                      1717
#define CLC2SEL2_D3S                  1718
#define LC2D3S0                       1719
#define CLC2SEL2_D3S0                 1720
#define LC2D3S                        1721
#define CLC2SEL2_D3S1                 1722
#define LC2D3S1                       1723
#define LC2D3S2                       1724
#define CLC2SEL2_D3S2                 1725
#define LC2D3S3                       1726
#define CLC2SEL2_D3S3                 1727
#define LC2D3S4                       1728
#define CLC2SEL2_D3S4                 1729
#define LC2D3S5                       1730
#define CLC2SEL2_D3S5                 1731
#define CLC2SEL3                      1732
#define LC2D4S0                       1733
#define CLC2SEL3_D4S                  1734
#define CLC2SEL3_D4S0                 1735
#define LC2D4S                        1736
#define LC2D4S1                       1737
#define CLC2SEL3_D4S1                 1738
#define LC2D4S2                       1739
#define CLC2SEL3_D4S2                 1740
#define CLC2SEL3_D4S3                 1741
#define LC2D4S3                       1742
#define LC2D4S4                       1743
#define CLC2SEL3_D4S4                 1744
#define LC2D4S5                       1745
#define CLC2SEL3_D4S5                 1746
#define CLC2GLS0                      1747
#define LC2G1D1N                      1748
#define CLC2GLS0_D1N                  1749
#define CLC2GLS0_D1T                  1750
#define LC2G1D1T                      1751
#define LC2G1D2N                      1752
#define CLC2GLS0_D2N                  1753
#define CLC2GLS0_D2T                  1754
#define LC2G1D2T                      1755
#define LC2G1D3N                      1756
#define CLC2GLS0_D3N                  1757
#define CLC2GLS0_D3T                  1758
#define LC2G1D3T                      1759
#define LC2G1D4N                      1760
#define CLC2GLS0_D4N                  1761
#define CLC2GLS0_D4T                  1762
#define LC2G1D4T                      1763
#define CLC2GLS1                      1764
#define CLC2GLS1_D1N                  1765
#define LC2G2D1N                      1766
#define CLC2GLS1_D1T                  1767
#define LC2G2D1T                      1768
#define CLC2GLS1_D2N                  1769
#define LC2G2D2N                      1770
#define CLC2GLS1_D2T                  1771
#define LC2G2D2T                      1772
#define LC2G2D3N                      1773
#define CLC2GLS1_D3N                  1774
#define LC2G2D3T                      1775
#define CLC2GLS1_D3T                  1776
#define LC2G2D4N                      1777
#define CLC2GLS1_D4N                  1778
#define LC2G2D4T                      1779
#define CLC2GLS1_D4T                  1780
#define CLC2GLS2                      1781
#define LC2G3D1N                      1782
#define CLC2GLS2_D1N                  1783
#define CLC2GLS2_D1T                  1784
#define LC2G3D1T                      1785
#define CLC2GLS2_D2N                  1786
#define LC2G3D2N                      1787
#define LC2G3D2T                      1788
#define CLC2GLS2_D2T                  1789
#define CLC2GLS2_D3N                  1790
#define LC2G3D3N                      1791
#define CLC2GLS2_D3T                  1792
#define LC2G3D3T                      1793
#define CLC2GLS2_D4N                  1794
#define LC2G3D4N                      1795
#define LC2G3D4T                      1796
#define CLC2GLS2_D4T                  1797
#define CLC2GLS3                      1798
#define LC2G4D1N                      1799
#define CLC2GLS3_G4D1N                1800
#define CLC2GLS3_G4D1T                1801
#define LC2G4D1T                      1802
#define CLC2GLS3_G4D2N                1803
#define LC2G4D2N                      1804
#define LC2G4D2T                      1805
#define CLC2GLS3_G4D2T                1806
#define CLC2GLS3_G4D3N                1807
#define LC2G4D3N                      1808
#define CLC2GLS3_G4D3T                1809
#define LC2G4D3T                      1810
#define LC2G4D4N                      1811
#define CLC2GLS3_G4D4N                1812
#define CLC2GLS3_G4D4T                1813
#define LC2G4D4T                      1814
#define CLC3CON                       1815
#define LC3MODE                       1816
#define CLC3CON_MODE0                 1817
#define LC3MODE0                      1818
#define CLC3CON_MODE                  1819
#define CLC3CON_MODE1                 1820
#define LC3MODE1                      1821
#define CLC3CON_MODE2                 1822
#define LC3MODE2                      1823
#define LC3INTN                       1824
#define CLC3CON_INTN                  1825
#define LC3INTP                       1826
#define CLC3CON_INTP                  1827
#define LC3OUT                        1828
#define CLC3CON_OUT                   1829
#define LC3EN                         1830
#define CLC3CON_EN                    1831
#define CLC3POL                       1832
#define LC3G1POL                      1833
#define CLC3POL_G1POL                 1834
#define LC3G2POL                      1835
#define CLC3POL_G2POL                 1836
#define CLC3POL_G3POL                 1837
#define LC3G3POL                      1838
#define LC3G4POL                      1839
#define CLC3POL_G4POL                 1840
#define LC3POL                        1841
#define CLC3POL_POL                   1842
#define CLC3SEL0                      1843
#define CLC3SEL0_D1S0                 1844
#define LC3D1S0                       1845
#define CLC3SEL0_D1S                  1846
#define LC3D1S                        1847
#define LC3D1S1                       1848
#define CLC3SEL0_D1S1                 1849
#define LC3D1S2                       1850
#define CLC3SEL0_D1S2                 1851
#define LC3D1S3                       1852
#define CLC3SEL0_D1S3                 1853
#define LC3D1S4                       1854
#define CLC3SEL0_D1S4                 1855
#define LC3D1S5                       1856
#define CLC3SEL0_D1S5                 1857
#define CLC3SEL1                      1858
#define CLC3SEL1_D2S                  1859
#define CLC3SEL1_D2S0                 1860
#define LC3D2S                        1861
#define LC3D2S0                       1862
#define CLC3SEL1_D2S1                 1863
#define LC3D2S1                       1864
#define CLC3SEL1_D2S2                 1865
#define LC3D2S2                       1866
#define CLC3SEL1_D2S3                 1867
#define LC3D2S3                       1868
#define CLC3SEL1_D2S4                 1869
#define LC3D2S4                       1870
#define CLC3SEL1_D2S5                 1871
#define LC3D2S5                       1872
#define CLC3SEL2                      1873
#define LC3D3S                        1874
#define CLC3SEL2_D3S                  1875
#define LC3D3S0                       1876
#define CLC3SEL2_D3S0                 1877
#define LC3D3S1                       1878
#define CLC3SEL2_D3S1                 1879
#define LC3D3S2                       1880
#define CLC3SEL2_D3S2                 1881
#define LC3D3S3                       1882
#define CLC3SEL2_D3S3                 1883
#define CLC3SEL2_D3S4                 1884
#define LC3D3S4                       1885
#define CLC3SEL2_D3S5                 1886
#define LC3D3S5                       1887
#define CLC3SEL3                      1888
#define CLC3SEL3_D4S0                 1889
#define LC3D4S0                       1890
#define CLC3SEL3_D4S                  1891
#define LC3D4S                        1892
#define LC3D4S1                       1893
#define CLC3SEL3_D4S1                 1894
#define LC3D4S2                       1895
#define CLC3SEL3_D4S2                 1896
#define LC3D4S3                       1897
#define CLC3SEL3_D4S3                 1898
#define LC3D4S4                       1899
#define CLC3SEL3_D4S4                 1900
#define LC3D4S5                       1901
#define CLC3SEL3_D4S5                 1902
#define CLC3GLS0                      1903
#define CLC3GLS0_D1N                  1904
#define LC3G1D1N                      1905
#define LC3G1D1T                      1906
#define CLC3GLS0_D1T                  1907
#define LC3G1D2N                      1908
#define CLC3GLS0_D2N                  1909
#define CLC3GLS0_D2T                  1910
#define LC3G1D2T                      1911
#define CLC3GLS0_D3N                  1912
#define LC3G1D3N                      1913
#define LC3G1D3T                      1914
#define CLC3GLS0_D3T                  1915
#define CLC3GLS0_D4N                  1916
#define LC3G1D4N                      1917
#define CLC3GLS0_D4T                  1918
#define LC3G1D4T                      1919
#define CLC3GLS1                      1920
#define LC3G2D1N                      1921
#define CLC3GLS1_D1N                  1922
#define CLC3GLS1_D1T                  1923
#define LC3G2D1T                      1924
#define LC3G2D2N                      1925
#define CLC3GLS1_D2N                  1926
#define LC3G2D2T                      1927
#define CLC3GLS1_D2T                  1928
#define LC3G2D3N                      1929
#define CLC3GLS1_D3N                  1930
#define CLC3GLS1_D3T                  1931
#define LC3G2D3T                      1932
#define LC3G2D4N                      1933
#define CLC3GLS1_D4N                  1934
#define LC3G2D4T                      1935
#define CLC3GLS1_D4T                  1936
#define CLC3GLS2                      1937
#define LC3G3D1N                      1938
#define CLC3GLS2_D1N                  1939
#define LC3G3D1T                      1940
#define CLC3GLS2_D1T                  1941
#define CLC3GLS2_D2N                  1942
#define LC3G3D2N                      1943
#define CLC3GLS2_D2T                  1944
#define LC3G3D2T                      1945
#define CLC3GLS2_D3N                  1946
#define LC3G3D3N                      1947
#define LC3G3D3T                      1948
#define CLC3GLS2_D3T                  1949
#define CLC3GLS2_D4N                  1950
#define LC3G3D4N                      1951
#define CLC3GLS2_D4T                  1952
#define LC3G3D4T                      1953
#define CLC3GLS3                      1954
#define LC3G4D1N                      1955
#define CLC3GLS3_G4D1N                1956
#define LC3G4D1T                      1957
#define CLC3GLS3_G4D1T                1958
#define LC3G4D2N                      1959
#define CLC3GLS3_G4D2N                1960
#define CLC3GLS3_G4D2T                1961
#define LC3G4D2T                      1962
#define LC3G4D3N                      1963
#define CLC3GLS3_G4D3N                1964
#define CLC3GLS3_G4D3T                1965
#define LC3G4D3T                      1966
#define LC3G4D4N                      1967
#define CLC3GLS3_G4D4N                1968
#define LC3G4D4T                      1969
#define CLC3GLS3_G4D4T                1970
#define CLC4CON                       1971
#define LC4MODE                       1972
#define CLC4CON_MODE                  1973
#define LC4MODE0                      1974
#define CLC4CON_MODE0                 1975
#define LC4MODE1                      1976
#define CLC4CON_MODE1                 1977
#define LC4MODE2                      1978
#define CLC4CON_MODE2                 1979
#define LC4INTN                       1980
#define CLC4CON_INTN                  1981
#define CLC4CON_INTP                  1982
#define LC4INTP                       1983
#define CLC4CON_OUT                   1984
#define LC4OUT                        1985
#define CLC4CON_EN                    1986
#define LC4EN                         1987
#define CLC4POL                       1988
#define CLC4POL_G1POL                 1989
#define LC4G1POL                      1990
#define CLC4POL_G2POL                 1991
#define LC4G2POL                      1992
#define CLC4POL_G3POL                 1993
#define LC4G3POL                      1994
#define LC4G4POL                      1995
#define CLC4POL_G4POL                 1996
#define LC4POL                        1997
#define CLC4POL_POL                   1998
#define CLC4SEL0                      1999
#define CLC4SEL0_D1S0                 2000
#define LC4D1S0                       2001
#define CLC4SEL0_D1S                  2002
#define LC4D1S                        2003
#define CLC4SEL0_D1S1                 2004
#define LC4D1S1                       2005
#define CLC4SEL0_D1S2                 2006
#define LC4D1S2                       2007
#define CLC4SEL0_D1S3                 2008
#define LC4D1S3                       2009
#define CLC4SEL0_D1S4                 2010
#define LC4D1S4                       2011
#define CLC4SEL0_D1S5                 2012
#define LC4D1S5                       2013
#define CLC4SEL1                      2014
#define LC4D2S0                       2015
#define CLC4SEL1_D2S                  2016
#define CLC4SEL1_D2S0                 2017
#define LC4D2S                        2018
#define CLC4SEL1_D2S1                 2019
#define LC4D2S1                       2020
#define LC4D2S2                       2021
#define CLC4SEL1_D2S2                 2022
#define LC4D2S3                       2023
#define CLC4SEL1_D2S3                 2024
#define LC4D2S4                       2025
#define CLC4SEL1_D2S4                 2026
#define LC4D2S5                       2027
#define CLC4SEL1_D2S5                 2028
#define CLC4SEL2                      2029
#define LC4D3S                        2030
#define CLC4SEL2_D3S                  2031
#define CLC4SEL2_D3S0                 2032
#define LC4D3S0                       2033
#define LC4D3S1                       2034
#define CLC4SEL2_D3S1                 2035
#define CLC4SEL2_D3S2                 2036
#define LC4D3S2                       2037
#define CLC4SEL2_D3S3                 2038
#define LC4D3S3                       2039
#define CLC4SEL2_D3S4                 2040
#define LC4D3S4                       2041
#define CLC4SEL2_D3S5                 2042
#define LC4D3S5                       2043
#define CLC4SEL3                      2044
#define LC4D4S0                       2045
#define LC4D4S                        2046
#define CLC4SEL3_D4S0                 2047
#define CLC4SEL3_D4S                  2048
#define LC4D4S1                       2049
#define CLC4SEL3_D4S1                 2050
#define LC4D4S2                       2051
#define CLC4SEL3_D4S2                 2052
#define LC4D4S3                       2053
#define CLC4SEL3_D4S3                 2054
#define LC4D4S4                       2055
#define CLC4SEL3_D4S4                 2056
#define LC4D4S5                       2057
#define CLC4SEL3_D4S5                 2058
#define CLC4GLS0                      2059
#define CLC4GLS0_D1N                  2060
#define LC4G1D1N                      2061
#define CLC4GLS0_D1T                  2062
#define LC4G1D1T                      2063
#define CLC4GLS0_D2N                  2064
#define LC4G1D2N                      2065
#define CLC4GLS0_D2T                  2066
#define LC4G1D2T                      2067
#define CLC4GLS0_D3N                  2068
#define LC4G1D3N                      2069
#define CLC4GLS0_D3T                  2070
#define LC4G1D3T                      2071
#define CLC4GLS0_D4N                  2072
#define LC4G1D4N                      2073
#define CLC4GLS0_D4T                  2074
#define LC4G1D4T                      2075
#define CLC4GLS1                      2076
#define CLC4GLS1_D1N                  2077
#define LC4G2D1N                      2078
#define CLC4GLS1_D1T                  2079
#define LC4G2D1T                      2080
#define LC4G2D2N                      2081
#define CLC4GLS1_D2N                  2082
#define LC4G2D2T                      2083
#define CLC4GLS1_D2T                  2084
#define CLC4GLS1_D3N                  2085
#define LC4G2D3N                      2086
#define LC4G2D3T                      2087
#define CLC4GLS1_D3T                  2088
#define CLC4GLS1_D4N                  2089
#define LC4G2D4N                      2090
#define CLC4GLS1_D4T                  2091
#define LC4G2D4T                      2092
#define CLC4GLS2                      2093
#define CLC4GLS2_D1N                  2094
#define LC4G3D1N                      2095
#define CLC4GLS2_D1T                  2096
#define LC4G3D1T                      2097
#define LC4G3D2N                      2098
#define CLC4GLS2_D2N                  2099
#define LC4G3D2T                      2100
#define CLC4GLS2_D2T                  2101
#define CLC4GLS2_D3N                  2102
#define LC4G3D3N                      2103
#define CLC4GLS2_D3T                  2104
#define LC4G3D3T                      2105
#define LC4G3D4N                      2106
#define CLC4GLS2_D4N                  2107
#define LC4G3D4T                      2108
#define CLC4GLS2_D4T                  2109
#define CLC4GLS3                      2110
#define CLC4GLS3_G4D1N                2111
#define LC4G4D1N                      2112
#define LC4G4D1T                      2113
#define CLC4GLS3_G4D1T                2114
#define LC4G4D2N                      2115
#define CLC4GLS3_G4D2N                2116
#define LC4G4D2T                      2117
#define CLC4GLS3_G4D2T                2118
#define CLC4GLS3_G4D3N                2119
#define LC4G4D3N                      2120
#define CLC4GLS3_G4D3T                2121
#define LC4G4D3T                      2122
#define LC4G4D4N                      2123
#define CLC4GLS3_G4D4N                2124
#define LC4G4D4T                      2125
#define CLC4GLS3_G4D4T                2126
#define STATUS_SHAD                   2127
#define C_SHAD                        2128
#define DC_SHAD                       2129
#define Z_SHAD                        2130
#define WREG_SHAD                     2131
#define BSR_SHAD                      2132
#define PCLATH_SHAD                   2133
#define FSR0L_SHAD                    2134
#define FSR0H_SHAD                    2135
#define FSR1L_SHAD                    2136
#define FSR1H_SHAD                    2137
#define STKPTR                        2138
#define TOSL                          2139
#define TOSH                          2140

#endif // _PIC16LF18325_H_
